---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.MomentOfInertiaStrongAxis
source: html/9f8db16a-595d-4816-9156-02a8b60f89c6.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.MomentOfInertiaStrongAxis Property

Moment of Inertia about main strong axis (I).

## Syntax (C#)
```csharp
public double MomentOfInertiaStrongAxis { get; set; }
```